from algutils.color_print import cprint
from algutils.utils import debug, vdebug, vvdebug

a⃗b⃗c⃗d⃗e⃗f⃗g⃗h⃗i⃗j⃗k⃗l⃗m⃗n⃗o⃗p⃗q⃗r⃗s⃗t⃗u⃗v⃗w⃗x⃗y⃗z⃗
αβγδεζηθικλμνξοπρστυφχψω
𝛼𝛽𝛾𝛿𝜖𝜁𝜂𝜃𝜊𝜋𝜅𝜇𝜈𝜉𝜊𝜋𝜌𝜎𝜏𝜑𝜒𝜓𝜔
aₓaᵧbₓbᵧpₓpᵧ

# ⎰ 𝛼a⃗ + 𝛽b⃗ = p⃗
# ⎱ 3𝛼 + 𝛽 minimal
#
# ⎧ 𝛼aₓ + 𝛽bₓ = pₓ
# ⎨ 𝛼aᵧ + 𝛽bᵧ = pᵧ
# ⎩ 3𝛼 + 𝛽 minimal
#
# ⎧ 𝛼 = (pₓbᵧ - pᵧbₓ) / (aₓbᵧ - aᵧbₓ)
# ⎨ 𝛼aᵧ + 𝛽bᵧ = pᵧ
# ⎩ 3𝛼 + 𝛽 minimal

# ⎧     pₓbᵧ - pᵧbₓ
# ⎪ 𝛼 = ───────────
# ⎪     aₓbᵧ - aᵧbₓ
# ⎨
# ⎪     pₓaᵧ - pᵧaₓ
# ⎪ 𝛽 = ───────────
# ⎩     bₓaᵧ - bᵧaₓ


def read_input_from_stdin() -> Pebbles:
    pass


def main() -> None:
    pass


if __name__ == "__main__":
    main()
